# Combining Similar Questions

In [2]:
import pandas as pd
import numpy as np
import sqlite3
import seaborn as sns
import matplotlib as mpl
import matplotlib.pyplot as plt
import warnings
import datetime
import matplotlib.dates as mdates

from scipy import stats
from matplotlib.dates import DateFormatter
from IPython.display import display

# Load and Display Raw Data

In [3]:
db_survey = sqlite3.connect(
    "C:\\Users\\Space\\Documents\\py\\Projects\\TuringCollege\\TechMentalHealth\\DataSet\\mental_health.sqlite"
)

In [4]:
%matplotlib inline
pd.options.display.max_rows = 300000
pd.options.display.max_columns = 999
pd.options.display.max_colwidth = 500

# Answers

In [5]:
df_answers = pd.read_sql_query("SELECT * FROM Answer", db_survey)
df_answers.head()

  AnswerText  SurveyID  UserID  QuestionID
0         37      2014       1           1
1         44      2014       2           1
2         32      2014       3           1
3         31      2014       4           1
4         31      2014       5           1

# Employer Provide Resources

In [50]:
df_Answer16 = pd.read_sql_query(
    "SELECT DISTINCT AnswerText FROM Answer where QuestionID = 16",
    db_survey
)
df_Answer16.head()

     AnswerText
0            No
1           Yes
2            -1
3  I don't know

In [48]:
df_Answer96 = pd.read_sql_query(
    "SELECT DISTINCT AnswerText FROM Answer where QuestionID = 96",
    db_survey
)
df_Answer96.head()

   AnswerText
0         Yes
1  Don't know
2          No

# Employer Discuss Mental Health Information

In [44]:
df_Answer15 = pd.read_sql_query(
    "SELECT DISTINCT AnswerText FROM Answer where QuestionID = 15",
    db_survey
)
df_Answer15.head()

     AnswerText
0            No
1           Yes
2            -1
3  I don't know

In [45]:
df_Answer95 = pd.read_sql_query(
    "SELECT DISTINCT AnswerText FROM Answer where QuestionID = 95",
    db_survey
)
df_Answer95.head()

   AnswerText
0          No
1  Don't know
2         Yes

# Employer Taking a Leave

In [42]:
df_Answer17 = pd.read_sql_query(
    "SELECT DISTINCT AnswerText FROM Answer where QuestionID = 17",
    db_survey
)
df_Answer17.head()

                   AnswerText
0                   Very easy
1               Somewhat easy
2  Neither easy nor difficult
3                          -1
4              Very difficult

In [43]:
df_Answer97 = pd.read_sql_query(
    "SELECT DISTINCT AnswerText FROM Answer where QuestionID = 97",
    db_survey
)
df_Answer97.head()

           AnswerText
0       Somewhat easy
1          Don't know
2  Somewhat difficult
3      Very difficult
4           Very easy